#include <iostream>
#include <string>

#ifndef SOURCE1_H_
#define SOURCE1_H_

#define KEY_Y 89
#define KEY_N 78

#define KEY_y 121
#define KEY_n 110


#define KEY_y_bg 234
#define KEY_n_bg 173


#define KEY_Y_bg 154
#define KEY_N_bg 141

#define ANS_a 160
#define ANS_b 161
#define ANS_c 162
#define ANS_d 163

const int numberOfQuestions = 10;

extern std::string questions[numberOfQuestions] = {
	"1.За следната компютърна конфигурация:700MHz Intel Celeron, ZIDA Tomato T810-CU i810 SB SVGA, 128MB SDRAM PC133, HDD 15GB ATA100 5400/2Mb, 15\" MOnitor, Modem 56k, 52x CD_ROM, FDD, Mouse, KBD, Speakers, големината на твърдия диск е:",
	"2.Свързването на клавиатурата като периферно устройство към компютърна система се извършва чрез:",
	"3.Необходимо ли е файл с размер 3, 4МB да бъде компресиран, за да се запише на стандартна 3, 5\" дискета?",
	"4.Една от основните характеристики на монитор в компютърна система е:",
	"5.Според начина на изграждане на символите шрифтовете се делят на:",
	"6.При преработка на компютърен текстов документ като се промени шрифтът на част от текста, се извършва:",
	"7.В текстообработваща система преди да се копира даден текст е необходимо той да бъде:",
	"8.При копиране на формула в електронна таблица, в която участват само клетки с абсолютна адресация:",
	"9.При векторна компютърна графика изображението се изгражда от:",
	"10.Пикселизацията е съществен недостатък на изображението при компютърната:"
};

extern std::string answers[3][numberOfQuestions * 4] = {
	{
		"а)56MB",
		"б)128MB",
		"в)10GB",
		"г)15GB",

		"а)модем",
		"б)порт",
		"в)контролер",
		"г)адаптер",

		"а)да",
		"б)не",
		"в)зависи от плътността",
		"г)зависи от програмата",

		"а)оперативна памет",
		"б)междуточково разстояние",
		"в)честота на трансфер",
		"г)пропускателна способност",

		"а)серифни и несерифни",
		"б)векторни и растерни",
		"в)графични и динамични",
		"г)кирилизирани и некирилизирани",

		"а)редактиране",
		"б)форматиране",
		"в)маркиране",
		"г)съхраняване",

		"а)редактиран",
		"б)форматиран",
		"в)подчертан",
		"г)маркиран",

		"а)резултатът  ще остане непроменен",
		"б)резултатът ще се преизчисли автоматично",
		"в)резултатът ще зависи от типа на данните",
		"г)резултатът ще зависи от формулата",

		"а)точки, оцветени по различен начин",
		"б)цветове, контури и форми",
		"в)уравнения или системи от уравнения",
		"г)множество от обекти, изградени от вектори",

		"а) векторна графика",
		"б) фрактална графика",
		"в) обектноориентирана графика",
		"г) растерна графика"
	},
	{
		"0",
		"0",
		"0",
		"0",

		"1",
		"1",
		"1",
		"1",

		"2",
		"2",
		"2",
		"2",

		"3",
		"3",
		"3",
		"3",

		"4",
		"4",
		"4",
		"4",

		"5",
		"5",
		"5",
		"5",

		"6",
		"6",
		"6",
		"6",

		"7",
		"7",
		"7",
		"7",

		"8",
		"8",
		"8",
		"8",

		"9",
		"9",
		"9",
		"9"
	},
	{

		"0",
		"0",
		"0",
		"1",

		"0",
		"1",
		"0",
		"0",

		"1",
		"0",
		"0",
		"0",

		"0",
		"1",
		"0",
		"0",

		"0",
		"1",
		"0",
		"0",

		"0",
		"1",
		"0",
		"0",

		"0",
		"0",
		"0",
		"1",

		"1",
		"0",
		"0",
		"0",

		"0",
		"0",
		"0",
		"1",

		"0",
		"0",
		"0",
		"1"
	}
};

#endif